using System.Collections.Generic;

namespace MagicMod;
// ItemID -> ItemName
public static class ItemData
{


    // 丹药
    public static Dictionary<int, string> ItemArr_DANYAO = new Dictionary<int, string>
    {
        {2245, "龙光倍力丸"},
        {2253, "聚珍伏虎丸"},
        {2224, "倍力丸"},
        {2227, "伏虎丸"},
        {2215, "九转还魂丹"},

        {2204, "温里散"},
        {2205, "度瘴散"},
        {2206, "神霄散"},
        {2207, "轻身散"},
        {2208, "清凉散"},

        {2210, "七返火丹"},

        {2211, "保命丹"},
        {2213, "登仙散"},

        {2218, "朝元膏"},
        {2221, "益气膏"},
        {2230, "延寿膏"},
        {2234, "坚骨药"},
        {2236, "镜中丹"},

        {2247, "避凶药"},
        {2251, "加味参势丸"},
        {2252, "参势丸"},


    };


    // 装备
    public static Dictionary<int, string> ItemArr_paojiu_equip = new Dictionary<int, string>
    {
        {3954, "虹霓云绦"},
        {3953, "细金线"},
        {3952, "寒铁叶"},
        {3961, "金趁心"},

        {3310, "虚空结"},
        {3309, "铁中血"},
        {3302, "金稳兽"},

        {3901, "玉垂牙"},
        {3902, "烈火乌金"},
        {3903, "铁石心"},
        {3904, "神风玛瑙"},
        {3905, "业火晶"},
        {3906, "连理肢"},
        {3907, "金光眼眸"},
        {3916, "银星雾角"},
        {3917, "摇山爪"},
        {3918, "架海筋"},
        {3919, "掣电尾"},
        {3920, "振雷骨"},
        {3921, "龙珠"},
        {3923, "万象圆光"},
        {3924, "金睛兽嚼"},
        {3925, "通天角"},
        {3926, "毒敌钩"},
        {3927, "大力铁角"},
        {3928, "妖生角"},
        {3929, "青丝刺"},
        {3930, "圆光万象"},
        {3931, "黑色眼眸"},
        {3932, "自在心"},

        {3962, "先天锟钢"},
        {1996, "饰品槽位"},
        {1998, "三冬虫"},
        {1999, "落伽香藤"},
        {1006, "灵光点"},
    };


    public static Dictionary<int, string> trans_list = new Dictionary<int, string>
  {
      {19, "小黄龙"},
      {17, "马猴"},
      {24, "巨猿"},

      {12, "广智"},

      {13, "石头人"},
      {14, "寅虎"},
      {15, "双头鼠"},
      {16, "海上僧"},
      {18, "虫"},
      {23, "马哥"},
      {11, "蝉"},
      {10, "变回悟空"},
  };
}
